app/Controllers/Kesehatan.php

INSERT INTO `tbl_Kesehatan` (`pasien`, `keluhan`, `pemeriksa`, `jenis_rawat`, `resep`) VALUES ('', '', '', '', '')
---
    public function save(){
        $this->dataKesehatan->save([
            'pasien' => $this->request->getVar('nama'),
            'keluhan' => $this->request->getVar('keluhan'),
            'pemeriksa' => $this->request->getVar('pemeriksa'),
            'jenis_rawat' => $this->request->getVar('jenis_rawat'),
            'resep' => $this->request->getVar('resep')
        ]);