app/Controllers/Santri.php

SELECT *
FROM `tbl_Santri`
WHERE `unit` = 'SD'
---
    public function index():string
    {
        $data = [
            'title' => 'List Data Santri SD',
            'tanggal_sekarang' => format_hari_tanggal(date('Y-m-d H:i:s')),
            'unit' => 'SD',
            'dataSantri' => $this->dataSantri->where('unit','SD')->findAll()

SELECT *
FROM `tbl_Santri`
WHERE `unit` = 'SMP'
---
    public function SMP()
    {
        $data = [
            'title' => 'List Data Santri SMP',
            'tanggal_sekarang' => format_hari_tanggal(date('Y-m-d H:i:s')),
            'unit' => 'SMP',
            'dataSantri' => $this->dataSantri->where('unit','SMP')->findAll()

INSERT INTO `tbl_Santri` (`nama_santri`, `nis`, `unit`, `kelas`, `tahun_ajaran`, `alamat`) VALUES ('Faris Hisyam Hardiman', '72613781267312', 'SMP', '2', '2022/2023', 'Warung Mdura')
---
    public function save(){
        $this->dataSantri->save([
            'nama_santri' => $this->request->getVar('namaSantri'),
            'nis' => $this->request->getVar('nis'),
            'unit'=>$this->request->getVar('unit'),
            'kelas' => $this->request->getVar('kelas'),
            'tahun_ajaran'=>$this->request->getVar('tahun_ajaran'),
            'alamat' => $this->request->getVar('alamat')
        ]);