app/Controllers/Tahfidz.php

    public function rekapTahfidz()
    {
        $rekapTahfidz = $this->dataTahfidz->findAll();
---
SELECT *
FROM `tbl_Tahfidz`